#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.module.gcloud_build_batch_events_handler.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.batch_events_handler_source: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_handler.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.load_gh_audit_log_source: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.data.archive_file.batch_events_handler_source: Read complete after 0s [id=d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=795832857450092111]
module.fourkeys.data.archive_file.load_gh_audit_log_source: Read complete after 0s [id=3e3b591035611305364327833ac77c3158d209d0]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6469184184091429422]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.google_service_account.unleash_sa: Refreshing state... [id=projects/off-net-dev/serviceAccounts/unleash-sa@off-net-dev.iam.gserviceaccount.com]
module.fourkeys.google_iam_workload_identity_pool.pool: Refreshing state... [id=projects/off-net-dev/locations/global/workloadIdentityPools/unleash-pool]
module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-station-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket: Refreshing state... [id=off-net-dev-batch-gh-log-function]
module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-archieve-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Reading...
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_storage_bucket.function_bucket: Refreshing state... [id=off-net-dev-function-gh-log-source]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Read complete after 0s [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_storage_bucket.dump_logs: Refreshing state... [id=off-net-dev-batch-gh-audit-logs]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Reading...
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_storage_bucket_object.load_gh_audit_log_zip: Refreshing state... [id=off-net-dev-function-gh-log-source-src-6638472b3dc9ee579dea7de9b53921b5.zip]
module.fourkeys.google_iam_workload_identity_pool_provider.provider: Refreshing state... [id=projects/off-net-dev/locations/global/workloadIdentityPools/unleash-pool/providers/unleash-provider]
module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job: Refreshing state... [id=off-net-dev/2870788994826366552]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Read complete after 1s [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]
module.fourkeys.google_cloudfunctions2_function.event_function: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/functions/batch-gh-log-handler-2]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 1s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.data.google_project.project: Read complete after 1s [id=projects/off-net-dev]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_events_handler will be created
  + resource "google_cloud_run_service" "batch_events_handler" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "northamerica-northeast1"
      + name                       = "batch-events-handler"
      + project                    = "off-net-dev"
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/minScale" = "1"
                  + "client.knative.dev/user-image"    = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff"
                  + "run.googleapis.com/client-name"   = "cloud-console"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "dora-wif@off-net-dev.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff"
                  + name  = (known after apply)

                  + env {
                      + name  = "project-name"
                      + value = "off-net-dev"
                    }

                  + resources {
                      + limits = {
                          + "memory" = "1024Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service_iam_binding.batch_event_handler_noauth will be created
  + resource "google_cloud_run_service_iam_binding" "batch_event_handler_noauth" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "northamerica-northeast1"
      + members  = [
          + "allUsers",
        ]
      + project  = "off-net-dev"
      + role     = "roles/run.invoker"
      + service  = "batch-events-handler"
    }

  # module.fourkeys.google_cloudfunctions2_function.event_function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "event_function" {
        id               = "projects/off-net-dev/locations/northamerica-northeast1/functions/batch-gh-log-handler-2"
        name             = "batch-gh-log-handler-2"
        # (10 unchanged attributes hidden)

      ~ build_config {
          - docker_repository     = "projects/off-net-dev/locations/northamerica-northeast1/repositories/gcf-artifacts" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ event_trigger {
          - retry_policy          = "RETRY_POLICY_DO_NOT_RETRY" -> null
          - trigger_region        = "northamerica-northeast1" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fourkeys.google_project_iam_binding.workload will be created
  + resource "google_project_iam_binding" "workload" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:unleash-sa@off-net-dev.iam.gserviceaccount.com",
        ]
      + project = "off-net-dev"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.fourkeys.google_project_iam_binding.writer will be created
  + resource "google_project_iam_binding" "writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:unleash-sa@off-net-dev.iam.gserviceaccount.com",
        ]
      + project = "off-net-dev"
      + role    = "roles/artifactregistry.writer"
    }

  # module.fourkeys.module.gcloud_build_batch_events_handler.null_resource.run_command[0] will be created
  + resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = {
          + "arguments"             = "367e6f7af74b0339506179d8deffa746"
          + "create_cmd_body"       = "builds submit ../batch_events_handler --tag=northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff --project=off-net-dev"
          + "create_cmd_entrypoint" = "gcloud"
          + "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
          + "md5"                   = "7f22bf39aaf5ce5980111c3587bef5b5"
        }
    }

  # module.fourkeys.module.gcloud_build_batch_events_handler.null_resource.run_destroy_command[0] will be created
  + resource "null_resource" "run_destroy_command" {
      + id       = (known after apply)
      + triggers = {
          + "destroy_cmd_body"       = "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_events_handler_container_url:d2c3770ca6aa2cb76ae14c2c515a686517dcc6ff --quiet"
          + "destroy_cmd_entrypoint" = "gcloud"
          + "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        }
    }

Plan: 6 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*